# Chapter 7: Data Cleaning and Preperation

## 7.1: Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data=pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data=pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data=pd.Series([1,2,None],dtype="float64")
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

### Filtering Out Missing Data

In [8]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data=pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df=pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1]=np.nan
df.iloc[:2,2]=np.nan
df

          0         1         2
0  0.744513       NaN       NaN
1 -0.909941       NaN       NaN
2  1.780333       NaN -1.049352
3 -0.893648       NaN  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [16]:
df.dropna()

          0         1         2
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [17]:
df.dropna(axis="columns")

          0
0  0.744513
1 -0.909941
2  1.780333
3 -0.893648
4  1.423955
5 -0.468350
6 -0.541272

In [18]:
df.dropna(how="all",axis="columns")

          0         1         2
0  0.744513       NaN       NaN
1 -0.909941       NaN       NaN
2  1.780333       NaN -1.049352
3 -0.893648       NaN  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [19]:
df.dropna(how="all")

          0         1         2
0  0.744513       NaN       NaN
1 -0.909941       NaN       NaN
2  1.780333       NaN -1.049352
3 -0.893648       NaN  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [20]:
df.dropna(axis="rows")

          0         1         2
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [21]:
df.dropna(thresh=2)

          0         1         2
2  1.780333       NaN -1.049352
3 -0.893648       NaN  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

### Filling In Missing Data

In [22]:
df

          0         1         2
0  0.744513       NaN       NaN
1 -0.909941       NaN       NaN
2  1.780333       NaN -1.049352
3 -0.893648       NaN  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [23]:
df.fillna(0)

          0         1         2
0  0.744513  0.000000  0.000000
1 -0.909941  0.000000  0.000000
2  1.780333  0.000000 -1.049352
3 -0.893648  0.000000  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.744513  0.500000  0.000000
1 -0.909941  0.500000  0.000000
2  1.780333  0.500000 -1.049352
3 -0.893648  0.500000  1.678732
4  1.423955  1.861169  0.029338
5 -0.468350 -1.522516 -1.802932
6 -0.541272  0.232315 -0.024370

In [25]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [26]:
df

          0         1         2
0  0.530595 -0.247929  0.740304
1  0.320633  0.759179  0.553614
2 -1.184945 -0.997279 -0.707863
3  1.150913 -0.228294  0.082581
4 -0.374720 -1.791321 -0.477552
5 -0.074601 -0.180773 -0.291949

In [27]:
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0         1         2
0  0.530595 -0.247929  0.740304
1  0.320633  0.759179  0.553614
2 -1.184945       NaN -0.707863
3  1.150913       NaN  0.082581
4 -0.374720       NaN       NaN
5 -0.074601       NaN       NaN

In [28]:
df.fillna(method="ffill")

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.530595 -0.247929  0.740304
1  0.320633  0.759179  0.553614
2 -1.184945  0.759179 -0.707863
3  1.150913  0.759179  0.082581
4 -0.374720  0.759179  0.082581
5 -0.074601  0.759179  0.082581

In [29]:
df.ffill()

          0         1         2
0  0.530595 -0.247929  0.740304
1  0.320633  0.759179  0.553614
2 -1.184945  0.759179 -0.707863
3  1.150913  0.759179  0.082581
4 -0.374720  0.759179  0.082581
5 -0.074601  0.759179  0.082581

In [30]:
df.fillna(method="ffill",limit=2)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\3768739427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  0.530595 -0.247929  0.740304
1  0.320633  0.759179  0.553614
2 -1.184945  0.759179 -0.707863
3  1.150913  0.759179  0.082581
4 -0.374720       NaN  0.082581
5 -0.074601       NaN  0.082581

In [31]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2: Data Transformation

### Removing Duplicates

In [32]:
data=pd.DataFrame({"k1":["one","two"]*3+["two"],
                   "k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data["v1"]=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(["k1","k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [38]:
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [39]:
data=pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                   "ounces":[4,3,12,6,7.5,8,3,5,6]})

In [40]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal={
    "bacon":"pig",
    "pulled pork":"pig",
    "pastrami":"cow",
    "corned beef":"cow",
    "honey ham":"pig",
    "nova lox":"salmon"
}

In [42]:
data["animal"]=data["food"].map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
def get_animal(x):
    return meat_to_animal[x]

In [45]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [46]:
meat_to_animal[data["food"][1]]

'pig'

### Replacing Values

In [47]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [52]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=["Ohio","Colorado","New York"],
                  columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [53]:
def transform(x):
    return x[:4].upper()

In [54]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [56]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [57]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
data.rename(index={"OHIO":"INDIANA","COLO":"COLO1"},columns={"three":"pekaboo"})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO1      4    5        6     7
NEW        8    9       10    11

In [59]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [60]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [61]:
bins=[18,25,35,60,100]

In [62]:
age_categories=pd.cut(ages,bins)

In [63]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
pd.DataFrame(age_categories)

            0
0    (18, 25]
1    (18, 25]
2    (18, 25]
3    (25, 35]
4    (18, 25]
5    (18, 25]
6    (35, 60]
7    (25, 35]
8   (60, 100]
9    (35, 60]
10   (35, 60]
11   (25, 35]

In [65]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [66]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [67]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [68]:
pd.value_counts(age_categories)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [69]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [70]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [71]:
pd.DataFrame({"Age":ages,"Categories":age_categories,"CategoriesLeft":pd.cut(ages,bins,right=False)})

    Age Categories CategoriesLeft
0    20   (18, 25]       [18, 25)
1    22   (18, 25]       [18, 25)
2    25   (18, 25]       [25, 35)
3    27   (25, 35]       [25, 35)
4    21   (18, 25]       [18, 25)
5    23   (18, 25]       [18, 25)
6    37   (35, 60]       [35, 60)
7    31   (25, 35]       [25, 35)
8    61  (60, 100]      [60, 100)
9    45   (35, 60]       [35, 60)
10   41   (35, 60]       [35, 60)
11   32   (25, 35]       [25, 35)

In [72]:
group_names=["Youth","YoungAdult","MiddleAged","Senior"]

In [73]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [74]:
pd.DataFrame({"Age":ages,"Categories":age_categories,"CategoriesLeft":pd.cut(ages,bins,right=False),"CategoriesLabels":pd.cut(ages,bins,labels=group_names,right=False)})

    Age Categories CategoriesLeft CategoriesLabels
0    20   (18, 25]       [18, 25)            Youth
1    22   (18, 25]       [18, 25)            Youth
2    25   (18, 25]       [25, 35)       YoungAdult
3    27   (25, 35]       [25, 35)       YoungAdult
4    21   (18, 25]       [18, 25)            Youth
5    23   (18, 25]       [18, 25)            Youth
6    37   (35, 60]       [35, 60)       MiddleAged
7    31   (25, 35]       [25, 35)       YoungAdult
8    61  (60, 100]      [60, 100)           Senior
9    45   (35, 60]       [35, 60)       MiddleAged
10   41   (35, 60]       [35, 60)       MiddleAged
11   32   (25, 35]       [25, 35)       YoungAdult

In [75]:
data=np.random.uniform(size=20)
data

array([0.38944307, 0.7506776 , 0.47741851, 0.47640343, 0.67579499,
       0.90416501, 0.4965411 , 0.14462477, 0.02595427, 0.86843324,
       0.20711517, 0.95116001, 0.72939021, 0.8312443 , 0.66251765,
       0.46060613, 0.40731547, 0.25382722, 0.29590302, 0.71697128])

In [76]:
pd.cut(data,4,precision=2)

[(0.26, 0.49], (0.72, 0.95], (0.26, 0.49], (0.26, 0.49], (0.49, 0.72], ..., (0.26, 0.49], (0.26, 0.49], (0.025, 0.26], (0.26, 0.49], (0.49, 0.72]]
Length: 20
Categories (4, interval[float64, right]): [(0.025, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.95]]

In [77]:
pd.DataFrame({"Data":data,"Categories":pd.cut(data,4,precision=2)})

        Data     Categories
0   0.389443   (0.26, 0.49]
1   0.750678   (0.72, 0.95]
2   0.477419   (0.26, 0.49]
3   0.476403   (0.26, 0.49]
4   0.675795   (0.49, 0.72]
5   0.904165   (0.72, 0.95]
6   0.496541   (0.49, 0.72]
7   0.144625  (0.025, 0.26]
8   0.025954  (0.025, 0.26]
9   0.868433   (0.72, 0.95]
10  0.207115  (0.025, 0.26]
11  0.951160   (0.72, 0.95]
12  0.729390   (0.72, 0.95]
13  0.831244   (0.72, 0.95]
14  0.662518   (0.49, 0.72]
15  0.460606   (0.26, 0.49]
16  0.407315   (0.26, 0.49]
17  0.253827  (0.025, 0.26]
18  0.295903   (0.26, 0.49]
19  0.716971   (0.49, 0.72]

In [78]:
data=np.random.standard_normal(1000)
quartiles=pd.qcut(data,4,precision=2)
quartiles

[(-3.4299999999999997, -0.74], (-0.74, 0.051], (-3.4299999999999997, -0.74], (-0.74, 0.051], (-0.74, 0.051], ..., (-0.74, 0.051], (-0.74, 0.051], (-0.74, 0.051], (-0.74, 0.051], (-0.74, 0.051]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4299999999999997, -0.74] < (-0.74, 0.051] < (0.051, 0.71] < (0.71, 3.82]]

In [79]:
quartiles.value_counts()

(-3.4299999999999997, -0.74]    250
(-0.74, 0.051]                  250
(0.051, 0.71]                   250
(0.71, 3.82]                    250
Name: count, dtype: int64

In [80]:
pd.qcut(data, [0, 0.1, 0.6, 0.9, 1.]).value_counts()

(-3.4219999999999997, -1.277]    100
(-1.277, 0.291]                  500
(0.291, 1.275]                   300
(1.275, 3.823]                   100
Name: count, dtype: int64

#### Detecting and Filtering Outliers

In [81]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.033988    -0.007957    -0.011096     0.003054
std       1.002816     1.035102     0.983157     0.991967
min      -3.279915    -3.626001    -2.619796    -3.385826
25%      -0.652905    -0.726699    -0.683636    -0.668816
50%       0.065415     0.008956    -0.014714     0.000942
75%       0.710210     0.681282     0.639312     0.655356
max       3.397574     3.289714     3.317034     3.581075

In [82]:
col=data[2]
col

0      0.871846
1      1.616642
2     -0.217989
3     -0.290018
4     -1.516756
         ...
995   -0.693200
996    0.220513
997    1.364533
998    0.397113
999   -0.750208
Name: 2, Length: 1000, dtype: float64

In [83]:
col[col.abs()>3]

317    3.041705
653    3.317034
Name: 2, dtype: float64

In [84]:
data[(data.abs()>3).any(axis="columns")]

            0         1         2         3
169  2.296560  3.289714  0.353206 -1.048556
208  0.714462 -3.626001  1.131179  0.245539
241 -0.510743  0.963068  0.343224 -3.362890
258  3.397574 -1.548795  0.327803 -1.426768
317 -0.670607  0.589282  3.041705 -0.221341
325  1.219473 -0.112709  0.351803 -3.053131
500 -3.279915  2.348409  0.546174  0.191306
613  3.214301  0.251759  1.324745  0.030893
653 -1.228346 -1.739306  3.317034 -0.096704
729 -0.814126 -1.782305  0.012391 -3.385826
737 -0.509755  0.264848  0.171786  3.267765
892 -3.051932 -1.166527 -0.645989  1.210190
905  0.533409  1.232382  0.168701  3.581075

In [85]:
data[data.abs()>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.033708    -0.007621    -0.011455     0.003007
std       0.999853     1.032214     0.982004     0.986606
min      -3.000000    -3.000000    -2.619796    -3.000000
25%      -0.652905    -0.726699    -0.683636    -0.668816
50%       0.065415     0.008956    -0.014714     0.000942
75%       0.710210     0.681282     0.639312     0.655356
max       3.000000     3.000000     3.000000     3.000000

### Permutation and Random Sampling

In [86]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [87]:
sampler=np.random.permutation(5)
sampler

array([3, 4, 0, 2, 1])

In [88]:
df.take(sampler)
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13

In [89]:
column_sampler=np.random.permutation(7)
column_sampler

array([4, 5, 0, 1, 3, 2, 6])

In [90]:
df.take(column_sampler,axis="columns")

    4   5   0   1   3   2   6
0   4   5   0   1   3   2   6
1  11  12   7   8  10   9  13
2  18  19  14  15  17  16  20
3  25  26  21  22  24  23  27
4  32  33  28  29  31  30  34

In [91]:
df.sample(n=3,axis="columns")

    2   6   5
0   2   6   5
1   9  13  12
2  16  20  19
3  23  27  26
4  30  34  33

In [92]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [93]:
choices=pd.Series([5,7,-1,6,4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [94]:
choices.sample(n=10,replace=True)

0    5
1    7
3    6
0    5
3    6
4    4
1    7
0    5
0    5
1    7
dtype: int64

### Computing Indicator/Dummy Variables

In [95]:
df=pd.DataFrame({"key":["b","b","a","c","a","b"],
                 "data1":range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [96]:
pd.get_dummies(df["key"],dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [97]:
dummies=pd.get_dummies(df["key"],prefix="key",dtype=float)
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [98]:
df_with_dummy=df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [99]:
from sympy import python


mnames=["movie_id","title","genres"]
movies=pd.read_table("../../datasets/movielens/movies.dat",sep="::",names=mnames,header=None,engine="python")
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [100]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [101]:
dummies=movies["genres"].str.get_dummies("|")
dummies.iloc[:10]

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
5,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0
6,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
7,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0
8,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
9,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0

In [102]:
movies_windic=movies.join(dummies.add_prefix("Genre_"))
movies_windic

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,3949,Requiem for a Dream (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,3950,Tigerland (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,3951,Two Family House (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,3952,"Contender, The (2000)",Drama|Thriller,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [103]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [104]:
np.random.seed(12345)
values=np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [105]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [106]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

## 7.3: Extension Data Types

In [107]:
s = pd.Series([1, 2, 3, None])
s
s.dtype

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

dtype('float64')

In [108]:
s1=pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [109]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s
s.isna()
s.dtype

0       1
1       2
2       3
3    <NA>
dtype: Int64

0    False
1    False
2    False
3     True
dtype: bool

Int64Dtype()

In [110]:
s[3] is pd.NA

True

In [111]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [112]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [113]:
df=pd.DataFrame({"A":[1,2,None,4],
                 "B":["one","two","three",None],
                 "C":[False,None,False,True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [114]:
df["A"].dtype

dtype('float64')

In [115]:
df["A"]=df["A"].astype("Int64")
df["B"]=df["B"].astype("string")
df["C"]=df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## 7.4: String Manipulation

### Python Built-In String Object Methods

In [116]:
val="a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [117]:
pieces=[x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [118]:
first,second,third=pieces
first+"::"+second+"::"+third

'a::b::guido'

In [119]:
"::".join(pieces)

'a::b::guido'

In [121]:
"guido" in val

True

In [122]:
val.index(",")

1

In [123]:
val.find("x")

-1

In [125]:
val.find("u")

7

In [126]:
val.index(":")

ValueError: substring not found

In [127]:
val.count(",")

2

In [128]:
val.replace(",","::")

'a::b::  guido'

In [129]:
val.replace(",","")

'ab  guido'

### Regular Expressions

In [130]:
import re

In [131]:
text="foo    bar\t baz  \tqux"
text

'foo    bar\t baz  \tqux'

In [132]:
re.split(r"\s+",text)

['foo', 'bar', 'baz', 'qux']

In [133]:
regex=re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [134]:
regex.findall(text)

['    ', '\t ', '  \t']

In [135]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [136]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com'

In [137]:
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [139]:
regex=re.compile(pattern, flags=re.IGNORECASE)

In [140]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [141]:
regex.search(text)

In [144]:
text[regex.search(text).start():regex.search(text).end()]

'dave@google.com'

In [145]:
regex.match(text)

In [146]:
regex.sub("REDACTED",text)

'Dave REDACTED\nSteve REDACTED\nRob REDACTED\nRyan REDACTED'

In [147]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [148]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [150]:
regex.match("wesm@bright.net").groups()

('wesm', 'bright', 'net')

In [151]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [152]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3",text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### String Functions in pandas

In [153]:
data={"Dave":"dave@google.com",
      "Steve":"steve@gmail.com",
      "Rob":"rob@gmail.com",
      "Wes":np.nan}
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [154]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [159]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [160]:
data_as_string_ext=data.astype("string")
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [162]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [165]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [167]:
data.str.findall(pattern,flags=re.IGNORECASE).str[0]

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [171]:
data.str.findall(pattern,flags=re.IGNORECASE).str[0].get(1)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\1385736162.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data.str.findall(pattern,flags=re.IGNORECASE).str[0].get(1)

('steve', 'gmail', 'com')

In [172]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [173]:
data.str.extract(pattern,flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

## 7.5: Categroical Data

### Background and Motivation

In [174]:
values=pd.Series(['apple','orange','apple','apple']*2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [175]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [176]:
pd.value_counts(values)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [177]:
values=pd.Series([0,1,0,0]*2)
dim=pd.Series(['apple','orange'])
values
dim

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

0     apple
1    orange
dtype: object

In [178]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

### Categorical Extension Type in pandas

In [180]:
fruits=['apple','orange','apple','apple']*2
N=len(fruits)
rng=np.random.default_rng(seed=12345)
df=pd.DataFrame({'fruit':fruits,
                 'basket_id':np.arange(N),
                 'count':rng.integers(3,15,size=N),
                 'weight':rng.uniform(0,4,size=N)},
                 columns=['basket_id','fruit','count','weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [181]:
fruit_cat=df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [182]:
c=fruit_cat.array
c
type(c)

['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']
Categories (2, object): ['apple', 'orange']

pandas.core.arrays.categorical.Categorical

In [183]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [184]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [185]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [187]:
df['fruit']=df['fruit'].astype("category")
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [188]:
my_categories=pd.Categorical(['foo','bar','baz','foo','bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [189]:
categories=['foo','bar','baz']
codes=[0,1,2,0,0,1]
my_cats_2=pd.Categorical.from_codes(codes,categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [190]:
pd.DataFrame(my_cats_2)

     0
0  foo
1  bar
2  baz
3  foo
4  foo
5  bar

In [191]:
ordered_cat=pd.Categorical.from_codes(codes,categories,ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [192]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

### Computations with Categoricals

In [193]:
rng=np.random.default_rng(seed=12345)
draws=rng.standard_normal(1000)
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [194]:
bins=pd.qcut(draws,4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [195]:
bins=pd.qcut(draws,4,labels=['Q1','Q2','Q3','Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [196]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [197]:
bins=pd.Series(bins,name="quartile")
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [204]:
pd.Series(draws).groupby(bins).agg(['count','min','max']).reset_index()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_23496\1778868159.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  pd.Series(draws).groupby(bins).agg(['count','min','max']).reset_index()

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [205]:
N=10000000
labels=pd.Series(['foo','bar','baz','qux']*(N//4))
len(labels)

10000000

In [206]:
labels.value_counts()

foo    2500000
bar    2500000
baz    2500000
qux    2500000
Name: count, dtype: int64

In [207]:
categories=labels.astype('category')

In [208]:
labels.memory_usage(deep=True)
categories.memory_usage(deep=True)

600000132

10000544

In [209]:
%time _ = labels.astype('category')

CPU times: total: 46.9 ms
Wall time: 308 ms

In [210]:
%timeit labels.value_counts()
%timeit categories.value_counts()

273 ms  14.6 ms per loop (mean  std. dev. of 7 runs, 1 loop each)
35.2 ms  2.07 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

### Categorical Methods

In [211]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: object

In [212]:
cat_s=s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [214]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [215]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [216]:
actual_categories=['a','b','c','d','e']
cat_s2=cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [217]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [219]:
cat_s3=cat_s[cat_s.isin(['a','b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [220]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']